# Задания экзамена по си, практика

## 2

Задание №2
Найти массу шара. Радиус шара вводиться в консоль ( радиус имеет тип double).
Плотность шара = 21500 кг/м^3
Даны формулы:
V = (4/3) * pi * R^3
P = m / V
Вывести массу округлив ее до целого числа математически верно.
Примечание:
Использовать константу M_PI, и функцию double round(double) из библиотеки math.h
Вывод должен выглядеть так:
printf("%.0lf", result) ;


## №2

Задание №2
Написать программу, осуществляющую перестановку крайних цифр в целом трехзначном
числе. Целое трёхзначное число задаётся на стандартном потоке stdin, результат
перестановки выводить в виде трёхзначного числа с учётом ведущих нулей на
стандартный поток вывода stdout.

В конце ответа не должно быть переноса.
вход: 159 результат: 951
вход: 120 результат: 021
вход: -123 результат: -321


## 3.
Задание №2
ввод не ограничен количеством целых чисел
на вывод: произведение нечетных чисел, если всего 2 числа  -
выводить ноль, если одно число - вывести его (но положительным)
ввод 	  | вывод
```
--------------------
1 2 3 4   | 3
--------------------
2 4         | 0
--------------------
-3    	   | 3
```

## 4.


Задание №2
Поступают числа x, y и z каждое из которых может принимать одно из двух значений
(0 и 1). Нужно вывести единицу, если значение следующего выражения истинно: x
and (z or y), в противном случае вывести 0. В конце ответа не должно быть
переноса на новую строку. Проверить на ввод 1 и 0, в случае ошибки вывести
"n/a". входные данные: 111 результат: 1 вход: 000 результат: 0



## 5.

Задание №2
Дана последовательность целых чисел Число n, Символ конца -1
Вывести x1 xn x2 xn-1 x3 xn-2 и так далее

## 6.

ЗАДАНИЯ 3 ЛВЛа
Задание №3
Найти и удалить последнее вхождение подстроки
То есть даются 2 строки:
This is mytext
my
Вывод должен был быть
This is text


## 7.
Задание №3 После того как не выполнил предыдущее
Дают число 123
Найти наибольшую цифру, то есть 3
```
----------
11111
1
—————.0.x
18
8
-----------
```

## 8.

Задание №3
Дается натуральное число Даются данные для заполнения Н структур
Структура состоит из имени (str) фамилия (str) рост int
После дается 1 положительное целое число и нужно вывести в строчку через запятую
фамилии и имена чей рост выше какого то значения


## 9.

Задание №3
На вход подается последовательность из чисел которая заканчивается -1
Задача - поменять местами первый появляющийся в последовательности наибольший и
наименьший элемент из целых неотрицательных чисел Проверить валидность данных


## 10.

Задание №3
проверить является ли строка палиндромом (строка должна заканчиваться \n)
входная строка может содержать буквы латинского алфавита и цифры, длина строки
до 100 символов ввод        	| вывод
```
------------------------
Mam mam  | YES
------------------------
Test1       	| NO
```

## 11.

Задание №4.
Дана строка вида:
"   test   sample test	text"
"    	text"
"            	t 	"
Каждая строка завершается символом '\n'
Убрать лишние пробелы в начале и в конце строки. Между словами оставить 1
пробел. В результате строка должна быть следующего вида: "test sample test text"
Сделал через бесконечный цикл, который работает, пока не встретит \n. С
пробелами разобрался с помощью флагов.



## 12.

Задание №4
На вход подается два инта - размер матрицы m x n
Задача повернуть матрицу на 90 градусов
```
input:
2 3
1 1 1 2 2 2 3 3 3

output:
1 2 3 1 2 3 1 2 3
```

## 14.

Задание №5Змейка с прошлого экзамена.
На вход дается n, вывести матрицу n*n заполненную по спирали
(там есть вариант заполнения от 1 до n
и есть вариант заполнения от 0 до n*n)

## 14.


## 15.

Первое задание: Вводится последовательность целых положительных чисел,
заканчивающаяся -1 (не входит в последовательность). Переставить первое
максимальное с первым минимальным местами. Проверить на ввод и в случае ошибки
вывести n/a.
Пример: 
Ввод: 1 2 3 4 5 6 7 8 9 -1 
Вывод: 9 2 3 4 5 6 7 8 1



## 16.


Второе задание: Посчитать количество предложений в файле, заканчивающихся на
".!?". Самое главное что файл вводится через stdin и его ввод заканчивается
"\n". По проверкам не успел погонять, так как у меня экзамен начался через 25
минут после начала, так как комп тупо тормозил.


## 17.


## 18.

"Открыть файл, спарсить строку вида Smith: 8-950-111-22-33 переформатировать ее
и вывести на печатать в виде: Smith +7(950)111-22-33"

